package com.noob.algorithm.daily.plan03.hot100_daily.day08.p026;

/**
 * 🟡 474 一和零 - https://leetcode.cn/problems/ones-and-zeroes/description/
 * 给出字符串strs和 整数m、n，找出并返回strs的最大子集长度，子集中最多有m个0、n个1
 */
public class Solution474_01 {

    /**
     * 思路分析：
     * dp[i][j] 表示基于i个0、j个1的限制下可放置的最大子集的长度，最大限制m个0、n个1，验证是否可放入背包（基于01背包的一维数组空间优化思路分析）
     * - 对于每个字符串可以选择是否要放入背包，不能超出背包容量（m个0、n个1）
     * - 1.如果可以放入(可以选择放或不放)：dp[i][j] = max{dp[i][j](不放入，继承上一状态),dp[i-zeroCnt][j-oneCnt] + 1 }
     * - 2.如果不可以放入：dp[i][j](不放入，继承上一状态)
     */
    public int findMaxForm(String[] strs, int m, int n) {
        // 1.dp定义：dp[i][j] 表示
        int[][] dp = new int[m + 1][n + 1];

        // 2.dp递推

        // 3.dp初始化
        dp[0][0] = 0; // 容量均为0放不下任何字符串（除非遇到空集，但测试用例限定`expected rows of 'strs' to have 1 <= size <= 100`）

        /**
         * 4.构建dp
         * 一维数组核心：
         * 外层物品： 即此处的字符串列表
         * 内层背包（背包逆序，避免值覆盖影响）：即此处的背包限制
         */
        // 外层物品
        for (String str : strs) {
            int[] cnt = getCnt(str);
            int zeroCnt = cnt[0];
            int oneCnt = cnt[1];
            // 内层背包：双逆序（思考此处为什么限定是遍历到zeroCnt、oneCnt（和普通一维的01背包问题类似，表示在可以空出该物品所需的容量之后加入该字符串，因此需要此处要限制两个背包的处理范围，可以结合公式来理解处理（数组不能越界）））
            for (int i = m; i >= zeroCnt; i--) {
                for (int j = n; j >= oneCnt; j--) {
                    dp[i][j] = Math.max(dp[i][j], dp[i - zeroCnt][j - oneCnt] + 1);
                }
            }
        }
        return dp[m][n];
    }

    /**
     * 统计指定字符串的所需的0、1个数（{zero、one}）
     */
    private int[] getCnt(String str) {
        // 统计当前字符串需要的0 1
        int zeroCnt = 0, oneCnt = 0;
        for (char ch : str.toCharArray()) {
            if (ch == '0') {
                zeroCnt++;
            } else if (ch == '1') {
                oneCnt++;
            }
        }
        return new int[]{zeroCnt, oneCnt};
    }

}
