package com.noob.algorithm.daily.plan03.hot100_daily.day09.p029;

/**
 * 🟢 121 买卖股票的最佳时机 - https://leetcode.cn/problems/best-time-to-buy-and-sell-stock/description/
 */
public class Solution121_02 {

    /**
     * 思路分析：动态规划
     * - ① dp[i][0] 第i天股票为持有状态下所获得的最大利润
     * - ② dp[i][1] 第i天股票为未持有状态下所获得的最大利润
     * =》max{①，②}
     */
    public int maxProfit(int[] prices) {

        int n = prices.length;
        // dp[i][j]
        int[][] dp = new int[n][2];

        // 初始化
        dp[0][0] = -prices[0]; // 第0天，如果要为持有状态则需买入股票
        dp[0][1] = 0; // 第0天，如果要为未持有状态则不需要做任何操作

        /**
         * 递推：
         * dp[i][0] = max{dp[i-1][0],dp[i-1][1]-prices[i]}(前一天持有继续持有，前一天未持有则买入)
         * dp[i][1] = max{dp[i-1][1],dp[i-1][0]+prices[i]}(前一天未持有则继续保持状态，前一天持有则卖出)
         */

        // 构建dp
        for (int i = 1; i < n; i++) {
            dp[i][0] = Math.max(dp[i - 1][0], 0 - prices[i]); // 因为只能买卖一次，因此如果买入的前置状态只能是第1次未持有
            dp[i][1] = Math.max(dp[i - 1][1], dp[i - 1][0] + prices[i]);
        }
        // 最后一天不持有股票可获得最大利润
        return dp[n - 1][1];
    }

}
